/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_valid.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taegon-i <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/10/08 23:31:13 by taegon-i          #+#    #+#             */
/*   Updated: 2018/10/08 23:44:16 by taegon-i         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "functions.h"

// пока совсем не доделана, надо много проверить
// нули, переход к другим мапам и тд

int	 ft_valid(**av)
{
	int i;
	int j;
	int l;

	l = ft_strlen(av);
	i = 0;
	if (av[l + 1] == '\n')
	{
		while (av[i])
		{
			while (av[i][j])
			{
				
				j++;
			}
			i++;
		}
	}
	else
		write(1, "map error\n", 10)
}
